{
  "agents": [
    {
      "name": "Alice",
      "description": "A studious and well-meaning student who accidentally came across the grade report and shared it, not realizing the consequences.",
      "goal": "Seek forgiveness from peers and help calm down the situation.",
      "x": 32,
      "y": 11,
      "actions": ["apologize", "explain"]
    },
    {
      "name": "Bob",
      "description": "A student who feels betrayed because his grades were part of the leak.",
      "goal": "Confront Alice and demand an explanation. Seek to restore his privacy.",
      "x": 33,
      "y": 11,
      "actions": ["confront", "discuss"]
    },
    {
      "name": "Carol",
      "description": "A sympathetic friend who wants to help mediate the situation and restore peace.",
      "goal": "Help Alice and Bob reconcile and spread positive vibes.",
      "x": 34,
      "y": 14,
      "actions": ["mediate", "support"]
    },
    {
      "name": "Mr. Smith",
      "description": "The principal who wants to handle the situation with discretion and maintain the school's integrity.",
      "goal": "Investigate the leak, implement measures to prevent future incidents, and maintain trust among students.",
      "x": 34,
      "y": 13,
      "actions": ["investigate", "reassure"]
    }
  ],
  "performance": {
    "numerator": "situations_resolved",
    "denominator": "total_incidents"
  },
  "questions": [
    {
      "who": "all",
      "question": "How has the grade leak affected your view on privacy and trust within the school?"
    },
    {
      "who": "all",
      "question": "What are the ethical implications of sharing someone's private information without their consent? How does it affect relationships within the school community, based on what you learned from the whole grade leak situation?"
    },
    {
      "who": "all",
      "question": "What measures can be implemented to prevent similar incidents in the future? Discuss any ideas you have for improving privacy and security at school."
    },
    {
      "who": "all",
      "question": "How has this incident impacted your personal feelings towards your peers and teachers? Has it changed how you view the school environment?"
    }
  ]
}

